tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# The fastest shell plugin manager
brew "antibody"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Free (GNU) replacement for the Pico text editor
brew "nano"
brew "eth-p/software/bat-extras"
# Acquire AWS credentials using Google Apps
brew "aws-google-auth"
# Official Amazon AWS command-line interface
brew "awscli"
# Distributed revision control system
brew "git"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Object-relational database system
brew "postgresql@9.5", restart_service: true
# Python version management
brew "pyenv"
# Node version management
brew "nodenv"
# Install various Ruby versions and implementations
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "redis", restart_service: true
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calculator and converter application\
cask "postico"
# Ruby on Rails IDE
cask "rubymine"
# System monitor for the menu bar
cask "stats"
# Application for inspecting installer packages
cask "suspicious-package"
# Open-source code editor
cask "visual-studio-code"

cask "alfred"
cask "dropbox"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "vlc"
cask "zoomus"
mas "Snappy", id: 512617038
mas "Xcode", id: 497799835