tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Shell plugin manager
brew "antibody"
# Acquire AWS credentials using Google Apps
brew "aws-google-auth"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Reverse tethering tool for Android
brew "gnirehtet"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple NodeJS versions
brew "nodenv"
# Object-relational database system
brew "postgresql@9.5", restart_service: true
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Stand alone ad blocker
cask "adguard"
# Apple TV Aerial screensaver
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Two-factor authentication software
cask "authy"
# Menu bar icon organizer
cask "bartender"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# PDF reader, editor and annotator
cask "pdf-expert"
# GUI client for PostgreSQL databases
cask "postico"
# Image viewer
cask "qview"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Ruby on Rails IDE
cask "rubymine"
# System monitor for the menu bar
cask "stats"
# Application for inspecting installer packages
cask "suspicious-package"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Video communication and virtual meeting platform
cask "zoom"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
mas "Boop", id: 1518425043
mas "Dato", id: 1470584107
mas "Download Shuttle", id: 847809913
mas "Dropover", id: 1355679052
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "HP Smart", id: 1474276998
mas "HyperDock", id: 449830122
mas "JustStream", id: 1474804779
mas "Keka", id: 470158793
mas "Lungo", id: 1263070803
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899
mas "NordVPN", id: 905953485
mas "NordVPN IKE", id: 1116599239
mas "OpenIn", id: 1547147101
mas "Pages", id: 409201541
mas "Phiewer (lite)", id: 1226444549
mas "Reeder", id: 1529448980
mas "Snappy", id: 512617038
mas "Surfshark", id: 1437809329
mas "Telegram", id: 747648890
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
