tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Shell plugin manager
brew "antibody"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple NodeJS versions
brew "nodenv"
# Python version management
brew "pyenv"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Stand alone ad blocker
cask "adguard"
# Apple TV Aerial screensaver
cask "aerial"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Two-factor authentication software
cask "authy"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Multi-language programming editor
cask "coderunner"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# PDF reader, editor and annotator
cask "pdf-expert"
# GUI client for PostgreSQL databases
cask "postico"
# Image viewer
cask "qview"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Boop", id: 1518425043
mas "Cloud Battery", id: 1481005137
mas "Dato", id: 1470584107
mas "Download Shuttle", id: 847809913
mas "Dropover", id: 1355679052
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "OpenIn", id: 1547147101
mas "OwlOCR", id: 1499181666
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Reeder", id: 1529448980
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
